
# Стадии игры
STAGES = {
    'start': 0,
    'first_roll': 1,
    'second_roll': 2,
    'third_roll': 3,
    'advice_choice': 4
}

# Данные для кубиков
FIRST_QUESTIONS = {
    1: "Что вас сейчас раздражает?",
    2: "Готовы ли вы рискнуть, чтобы запустить изменения?",
    3: "Какие у вас препятствия для реализации своего запроса?",
    4: "Что вы не готовы менять?",
    5: "Кому вы пытаетесь угодить?",
    6: "Что вам недодали в детстве?"
}

SECOND_QUESTIONS = {
    1: "Что для вас является источником вдохновения?",
    2: "Что вам нравится делать?",
    3: "За что вы получаете комплименты, добрые слова?",
    4: "Ваше лучшее решение за последние 5 лет?",
    5: "Если бы вы могли полностью изменить один день вашей жизни, то какой день выбираете?",
    6: "Если бы вы могли взмахнуть волшебной палочкой и исполнить только одно желание, чтобы это было?"
}

THIRD_RESOURCES = {
    1: "Верь в себя",
    2: "Доверяй жизни",
    3: "Проявляй любовь",
    4: "Разреши себе успех",
    5: "Проявляй благодарность",
    6: "Будь творцом своей жизни"
}

ADVICE_CARDS = {
    1: "Если по отношению к другому человеку у вас возникают негативные мысли, то они проявляются и в вашей жизни. Подумайте, чью жизнь вы улучшаете, хорошо думая о других?",
    2: "Напишите чего вы хотите, начиная со слов «Я так счастлива ….»",
    3: "Что сейчас делает вас счастливым? Наслаждайтесь этим моментом",
    4: "Оставьте прошлые неудачи в прошлом. Подумайте для чего они вам были даны. Поблагодарите за урок.",
    5: "Вы в ответе только за себя. Не пытайтесь изменить другого человека. Направьте свою энергию на создание жизни, о которой вы мечтаете.",
    6: "Верьте и получите! У Вселенной нет времени и ограничений. Она может все…"
}

